In [64]:
import pandas as pd

# **Data Selection in Series**

* **Series in Dictionary**

In [65]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], 
                 index=['a', 'b', 'c', 'd'])

print(data)

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [66]:
data['b']

0.5

In [67]:
'a' in data

True

In [68]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [69]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [70]:
data['e'] = 1.25

* **Series as one-dimensional array**

In [71]:
# slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [72]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [73]:
#masking
data[(data > 0.3)&(data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [74]:
#fancy indexing
data[['a','e']]

a    0.25
e    1.25
dtype: float64

* **Indexer: loc,iloc, and ix**

In [75]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
print(data)

1    a
3    b
5    c
dtype: object

In [76]:
# eksplisit index pada indexing
data[1]

'a'

In [77]:
# implisist index pada slicing
data[1:3]

3    b
5    c
dtype: object

In [78]:
data.iloc[1]

'b'

In [79]:
data.iloc[1:3]

3    b
5    c
dtype: object

# **Data Selection in DataFrame**

* **DataFrame as a Dictionary**

In [80]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                  'New York': 19651127, 'Florida': 19552860,
                  'Illinois': 12882135})
data = pd.DataFrame({'area': area, 'pop': pop})
print(data)

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [81]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [82]:
# atau dapat ditulis dengan
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [83]:
# in boolean
data.area is data['area']

True

In [84]:
data.pop is data['pop']

False

In [85]:
# membuat row baru
data['Density'] = data['pop']/data['area']
print(data)

              area       pop     Density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

* **DataFrame as two-dimensional array**

In [86]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [87]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
Density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [88]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [89]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [90]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [91]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [92]:
data.loc[data.area > 100, ['pop', 'area']]

                 pop    area
California  38332521  423967
Texas       26448193  695662
New York    19651127  141297
Florida     19552860  170312
Illinois    12882135  149995

In [93]:
data.iloc[0, 2] = 90
print(data)

              area       pop     Density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

* **Additional Indexing conventions**

In [94]:
data['Florida':'Illinois']

            area       pop     Density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [95]:
data[1:3]

            area       pop     Density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [97]:
data[data.Density > 100]

            area       pop     Density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121